OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    inlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box   (-0.001 0.25 1.1)(0.001 0.75 1.3);
        }
    }
    {
        name    outlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box   (1.75 2.999 0.3)(2.25 3.001 0.5);
        }
    }
);

// ************************************************************************* //
